#include "kern.h"

void
entry(void) {
    /**********************************************************************
     *       下面设置的所有寄存器和 `boot/config_boot.h` 的定义保持一致         *
     **********************************************************************/
    __asm__ ("movw $0x10,    %ax\r\n"
             "movw %ax,      %ds\r\n"
             "movw %ax,      %es\r\n"
             "movw %ax,      %fs\r\n"
             "movw %ax,      %gs\r\n"
             "movw %ax,      %ss\r\n"
             "movl $0x80000, %esp\r\n"
             // 设置 DIED 指令
             "pushl $0x77ffc\r\n"
             // 设置调用约定
             "pushl $0\r\n"
             "movl %esp,     %ebp\r\n"
             "pushl $go\r\n"
             // 跳去高地址
             "ret\r\n"
             "go:\r\n");

    kern_init();
    kern_exec();

    /**********************************************************************
     *       不需要返回，但返回也没问题因为 DIED 指令会作为返回地址出栈            *
     **********************************************************************/
}
